Revit 2027 API
ParameterTypeId.MatchlineTopPlane Property
 "Top Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MatchlineTopPlane { get; }
Public Shared ReadOnly Property MatchlineTopPlane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MatchlineTopPlane {
	ForgeTypeId^ get ();
}
static member MatchlineTopPlane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace